internal class Program
{
    private static void Main(string[] args)
    {
        // Абстрактная фабрика — это более сложный паттерн, который позволяет создавать целые семейства взаимосвязанных
        // или зависимых объектов без указания их конкретных классов. Она создает группу объектов,
        // которые связаны друг с другом. То есть она не ограничивается созданием одного продукта,
        // а создаёт целую серию продуктов, относящихся к одной тематике.
        Console.WriteLine("Hello, World!");
    }
}