namespace VisitorPattern
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Паттерн Посетитель (Visitor) позволяет определить операцию для объектов других классов
            // без изменения этих классов.

            // При использовании паттерна Посетитель определяются две иерархии классов:
            // одна для элементов, для которых надо определить новую операцию,
            // и вторая иерархия для посетителей, описывающих данную операцию.
        }
    }
}
